# GetPresureDropItems Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryPressureDropData..::..GetPresureDropItems Method
PipeFittingAndAccessoryPressureDropData Class See Also
---
Returns the pressure drop items
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<PipeFittingAndAccessoryPressureDropItem> GetPresureDropItems()
```

Visual Basic
---
```text
Public Function GetPresureDropItems As IList(Of PipeFittingAndAccessoryPressureDropItem)
```

Visual C++
---
```text
public:
IList<PipeFittingAndAccessoryPressureDropItem^>^ GetPresureDropItems()
```

# See Also
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace